geek4fun.fr/app/Models/Admin.php

SELECT *
FROM `utilisateur`
---
    function afficherUtilisateur()
    {
        $db = db_connect();
        $query = $db->table('utilisateur');
        $result = $query->get();

SELECT *
FROM `utilisateur`
WHERE `utilisateur_id` = 'AREB'
---
    function afficherUtilisateurModif($id)
    {
        $db = db_connect();
        $query = $db->table('utilisateur');
        $result = $query->getWhere(['utilisateur_id'=>$id]);

SELECT *
FROM `utilisateur`
WHERE `utilisateur_id` = 'AREB'
---
    public function retourPrenomNom($id)
    {
        $db = db_connect();
        $query = $db->table('utilisateur');
        $result = $query->getWhere(['utilisateur_id'=>$id])->getResultArray();