geek4fun.fr/app/Models/Connexion.php

SELECT *
FROM `utilisateur`
WHERE `utilisateur_login` = 'arebhuhn'
---
    function verifUser($loginVerif)
    {
        $db = db_connect();
        $query = $db->table('utilisateur');
        $result = $query->getWhere(['utilisateur_login'=>$loginVerif]);

INSERT INTO `utilisateur` (`utilisateur_id`, `utilisateur_nom`, `utilisateur_prenom`, `utilisateur_dateDeNaissance`, `utilisateur_mail`, `utilisateur_telephone`, `utilisateur_ville`, `utilisateur_login`, `utilisateur_motDePasse`, `utilisateur_accepterCharte`, `utilisateur_droitImage`, `id_type`) VALUES ('', 'roquette', 'pierre', '2006-05-12', 'PierreRocket@gmail.com', '0260568595', 'Tours', 'procket', '$2y$10$S6GL0mBGBkaVCTk101NIAuo64OksXCBkCKybftGivyIFuQ04vvI22', 1, 1, 2)
---
    function inscription($newUser)
    {
        $db = db_connect();
        try {
            $query = $db->table('utilisateur')->insert($newUser);